# Download name.basics.tsv and Read

In [15]:
import pandas as pd
actors = pd.read_csv('/Users/apillai2/Downloads/name.basics.tsv', sep='\t', header=0)

In [16]:
print("Actor Count before Filter:",len(actors))
actors=actors[(actors.birthYear != '\\N')]
actors = actors[(actors.birthYear > '1940') & (actors.primaryProfession.str.contains('act'))]

actors['titleCount'] = actors['knownForTitles'].str.count(',')+1
print("Actor Count after Filter:",len(actors))
actors = actors[(actors.titleCount > 3)]
actors = actors[['nconst','primaryName']]
actors.head()

Actor Count before Filter: 11359935
Actor Count after Filter: 220915

       nconst        primaryName
3   nm0000004       John Belushi
28  nm0000029  Margaux Hemingway
83  nm0000084            Gong Li
86  nm0000087     Elena Koreneva
90  nm0000091       Gérard Pirès

In [17]:
import pandas as pd
princ = pd.read_csv('/Users/apillai2/Downloads/title.principals.tsv', sep='\t', header=0)
princ.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [18]:
princ = princ[(princ.category.str.contains('act'))][['nconst','tconst']]
actors = actors.merge(princ,how='inner')
print(len(actors))
actors.head()

7515381

      nconst   primaryName     tconst
0  nm0000004  John Belushi  tt0076816
1  nm0000004  John Belushi  tt0077621
2  nm0000004  John Belushi  tt0077975
3  nm0000004  John Belushi  tt0078723
4  nm0000004  John Belushi  tt0079660

In [19]:
import pandas as pd
titles = pd.read_csv('/Users/apillai2/Downloads/title.akas.tsv', sep='\t', header=0)
titles = titles[titles.region == 'US']
titles.head()

/Users/apillai2/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
14,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
35,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
39,tt0000005,5,Blacksmith Scene #1,US,\N,alternative,\N,0
40,tt0000005,6,Blacksmithing,US,\N,\N,informal alternative title,0

In [20]:
import pandas as pd
basics = pd.read_csv('/Users/apillai2/Downloads/title.basics.tsv', sep='\t', header=0)
basics = basics[basics.titleType == 'movie'][['tconst']]
basics.columns = ['titleId']
basics.head()

/Users/apillai2/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (4,5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

       titleId
498  tt0000502
570  tt0000574
587  tt0000591
610  tt0000615
625  tt0000630

In [21]:
titles = titles.merge(basics,how='inner')
del basics
print(len(titles))
titles.head()

301354

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000574,6,The Story of the Kelly Gang,US,\N,imdbDisplay,\N,0
1,tt0000591,3,The Prodigal Son,US,\N,\N,\N,0
2,tt0000630,4,Hamlet,US,\N,\N,\N,0
3,tt0000679,3,The Fairylogue and Radio-Plays,US,\N,imdbDisplay,\N,0
4,tt0000886,2,"Hamlet, Prince of Denmark",US,\N,\N,\N,0

In [22]:
df_titles = pd.DataFrame((titles[titles.region == 'US']['titleId'].unique()))
del titles
df_titles.columns = ['tconst']
df_titles.head()

      tconst
0  tt0000574
1  tt0000591
2  tt0000630
3  tt0000679
4  tt0000886

In [23]:
import pandas as pd
ratings = pd.read_csv('/Users/apillai2/Downloads/title.ratings.tsv', sep='\t', header=0)
print(len(ratings))
ratings.head()

1201921

      tconst  averageRating  numVotes
0  tt0000001            5.7      1834
1  tt0000002            6.0       236
2  tt0000003            6.5      1595
3  tt0000004            6.0       153
4  tt0000005            6.2      2411

In [24]:
ratings = ratings[ratings.numVotes > 2000]
print(len(ratings))
ratings = ratings[['tconst']]
df_titles = df_titles.merge(ratings,how='inner')
print(len(df_titles))
df_titles.head()

41363
22978

      tconst
0  tt0002130
1  tt0002844
2  tt0003419
3  tt0003740
4  tt0004707

In [25]:
actors = actors.merge(df_titles,how='inner')
actors = actors.reset_index(drop=True)
print(len(actors))
actors.head()

57041

      nconst       primaryName     tconst
0  nm0000004      John Belushi  tt0077621
1  nm0005460  Mary Steenburgen  tt0077621
2  nm0000004      John Belushi  tt0077975
3  nm0000261       Karen Allen  tt0077975
4  nm0001371         Tom Hulce  tt0077975

In [26]:
print("Total Movies : ",len(actors['tconst'].unique()))
print("Total Actors : ",len(actors['nconst'].unique()))

Total Movies :  18657
Total Actors :  17435

# Write File

In [27]:
actors.to_csv('actorsOrig.csv',header=True,index=False)

In [28]:
print(len(actors))

57041